; domain
(define (domain ferry)
   (:predicates (not-eq ?x ?y)
		(car ?c)
		(location ?l)
		(at-ferry ?l)
		(at ?c ?l)
		(empty-ferry)
		(on ?c))

   (:action sail
       :parameters  (?from ?to)
       :precondition (and (not-eq ?from ?to) 
                          (location ?from) (location ?to) (at-ferry ?from))
       :effect (and  (at-ferry ?to)
		     (not (at-ferry ?from))))


   (:action board
       :parameters (?car ?loc)
       :precondition  (and  (car ?car) (location ?loc)
			    (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters  (?car  ?loc)
       :precondition  (and  (car ?car) (location ?loc)
			    (on ?car) (at-ferry ?loc))
       :effect (and (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-l4-c3)
(:domain ferry)
(:objects l0 l1 l2 l3 
          c0 c1 c2 
)
(:init
(location l0)
(location l1)
(location l2)
(location l3)
(car c0)
(car c1)
(car c2)
(not-eq l0 l1)
(not-eq l1 l0)
(not-eq l0 l2)
(not-eq l2 l0)
(not-eq l0 l3)
(not-eq l3 l0)
(not-eq l1 l2)
(not-eq l2 l1)
(not-eq l1 l3)
(not-eq l3 l1)
(not-eq l2 l3)
(not-eq l3 l2)
(empty-ferry)
(at c0 l0)
(at c1 l0)
(at c2 l2)
(at-ferry l3)
)
(:goal
(and
(at c0 l0)
(at c1 l2)
(at c2 l0)
)
)

(:constraints
  (and
    (sometime-before  (at c1 l2) (at-ferry l1))
    (sometime-before  (at c2 l0) (at-ferry l1))
  )
)
)

; plan
1. (sail l3 l0)
   deleted: (at-ferry l3)
   added: (at-ferry l0)
   goals met: 1 of 3
2. (board c1 l0)
   deleted: (at c1 l0) (empty-ferry)
   added: (on c1)
   goals met: 1 of 3
3. (sail l0 l1)
   deleted: (at-ferry l0)
   added: (at-ferry l1)
   goals met: 1 of 3
4. (debark c1 l1)
   deleted: (on c1)
   added: (at c1 l1) (empty-ferry)
   goals met: 1 of 3
5. (sail l1 l2)
   deleted: (at-ferry l1)
   added: (at-ferry l2)
   goals met: 1 of 3
6. (board c2 l2)
   deleted: (at c2 l2) (empty-ferry)
   added: (on c2)
   goals met: 1 of 3
7. (sail l2 l0)
   deleted: (at-ferry l2)
   added: (at-ferry l0)
   goals met: 1 of 3
8. (debark c2 l0)
   deleted: (on c2)
   added: (at c2 l0) (empty-ferry)
   goals met: 2 of 3
9. (sail l0 l1)
   deleted: (at-ferry l0)
   added: (at-ferry l1)
   goals met: 2 of 3
10. (board c1 l1)
   deleted: (at c1 l1) (empty-ferry)
   added: (on c1)
   goals met: 2 of 3
11. (sail l1 l2)
   deleted: (at-ferry l1)
   added: (at-ferry l2)
   goals met: 2 of 3
12. (debark c1 l2)
   deleted: (on c1)
   added: (at c1 l2) (empty-ferry)
   goals met: 3 of 3
